Revit 2024 API
ExportLineweightInfo Constructor
Overload List
Name | Description
ExportLineweightInfo()
 Constructs a new default ExportLineweightInfo.
ExportLineweightInfo(String)
 Constructs a new ExportLineweightInfo using the destination line weight name as input.
ExportLineweightInfo(ExportLineweightInfo)
 Constructs a new copy of the input ExportLineweightInfo object.
See Also
ExportLineweightInfo Class
ExportLineweightInfo Members
Autodesk.Revit.DB Namespace